Revit 2024 API
LineLoad.IsCurveInsideHostBoundaries Method
 Indicates if the curve is inside panel's boundaries or on panel's edges or if the curve is on the member's curve.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static bool IsCurveInsideHostBoundaries(
	Document doc,
	ElementId hostId,
	Curve curve
)
Visual Basic
Public Shared Function IsCurveInsideHostBoundaries ( _
	doc As Document, _
	hostId As ElementId, _
	curve As Curve _
) As Boolean
Visual C++
public:
static bool IsCurveInsideHostBoundaries(
	Document^ doc,
	ElementId^ hostId,
	Curve^ curve
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The document containing both the host and the line load.
hostId
Type: Autodesk.Revit.DB.ElementId
 The id of the analytical element that is about to host a line load.
curve
Type: Autodesk.Revit.DB.Curve
 Curve to be checked.
Return Value
 True if a line load can be placed on the input host id
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace